CSI API ETABS v1
cTower.AddNewTower Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int AddNewTower(
	string TowerName,
	int NumberStories,
	double TypicalStoryHeight,
	double BotttomStoryHeight
)
Function AddNewTower (
	TowerName As String,
	NumberStories As Integer,
	TypicalStoryHeight As Double,
	BotttomStoryHeight As Double
) As Integer
Dim instance As cTower
Dim TowerName As String
Dim NumberStories As Integer
Dim TypicalStoryHeight As Double
Dim BotttomStoryHeight As Double
Dim returnValue As Integer
returnValue = instance.AddNewTower(TowerName,
	NumberStories, TypicalStoryHeight,
	BotttomStoryHeight)
int AddNewTower(
	String^ TowerName,
	int NumberStories,
	double TypicalStoryHeight,
	double BotttomStoryHeight
)
abstract AddNewTower :
        TowerName : string *
        NumberStories : int *
        TypicalStoryHeight : float *
        BotttomStoryHeight : float -> int
Parameters
TowerName
Type: System.String
NumberStories
Type: System.Int32
TypicalStoryHeight
Type: System.Double
BotttomStoryHeight
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cTower Interface
ETABSv1 Namespace